results/cpu-vs-latency3/memcached/14-3/nsl204.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     2077605 ops,   81255 (avg:   69252) ops/sec, 3.06MB/sec (avg: 2.61MB/sec),  0.69 (avg:  0.81) msec latency

4         Threads
14        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        6093.56          ---          ---      0.81400       451.69
Gets       60925.74     16705.53     44220.21      0.80400      2136.39
Totals     67019.30     16705.53     44220.21      0.80500      2588.09


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     94.96721
SET       2.000     99.79143
SET       3.000     99.92589
SET       4.000     99.99312
SET       6.000     99.99471
SET       8.000     99.99524
SET       9.000     99.99576
SET      17.000     99.99629
SET      19.000     99.99682
SET      21.000     99.99735
SET      23.000     99.99788
SET      24.000     99.99841
SET      26.000     99.99894
SET      28.000     99.99947
SET      32.000    100.00000
---
GET       0.096      0.00005
GET       0.097      0.00016
GET       0.099      0.00021
GET       0.100      0.00042
GET       0.110      0.00053
GET       0.120      0.00095
GET       0.130      0.00164
GET       0.140      0.00371
GET       0.150      0.00641
GET       0.160      0.00858
GET       0.170      0.01059
GET       0.180      0.01260
GET       0.190      0.01668
GET       0.200      0.02060
GET       0.210      0.02367
GET       0.220      0.02653
GET       0.230      0.03018
GET       0.240      0.03553
GET       0.250      0.04363
GET       0.260      0.05406
GET       0.270      0.06751
GET       0.280      0.08900
GET       0.290      0.12792
GET       0.300      0.19521
GET       0.310      0.32186
GET       0.320      0.59723
GET       0.330      1.16313
GET       0.340      2.27034
GET       0.350      4.04325
GET       0.360      6.53279
GET       0.370      9.77819
GET       0.380     13.81159
GET       0.390     18.50475
GET       0.400     22.70282
GET       0.410     25.96728
GET       0.420     28.33742
GET       0.430     29.99565
GET       0.440     31.12192
GET       0.450     31.76485
GET       0.460     32.12335
GET       0.470     32.33503
GET       0.480     32.46501
GET       0.490     32.55995
GET       0.500     32.63725
GET       0.510     32.72916
GET       0.520     32.85057
GET       0.530     33.04170
GET       0.540     33.35774
GET       0.550     33.85909
GET       0.560     34.59510
GET       0.570     35.63338
GET       0.580     37.01363
GET       0.590     38.76706
GET       0.600     40.73852
GET       0.610     42.83535
GET       0.620     44.92647
GET       0.630     46.92652
GET       0.640     48.68174
GET       0.650     50.08869
GET       0.660     51.18610
GET       0.670     52.02006
GET       0.680     52.66124
GET       0.690     53.16402
GET       0.700     53.63191
GET       0.710     54.13532
GET       0.720     54.73658
GET       0.730     55.48201
GET       0.740     56.38888
GET       0.750     57.46475
GET       0.760     58.64948
GET       0.770     59.88715
GET       0.780     61.14801
GET       0.790     62.30092
GET       0.800     63.31691
GET       0.810     64.16040
GET       0.820     64.83096
GET       0.830     65.38007
GET       0.840     65.83525
GET       0.850     66.23478
GET       0.860     66.63506
GET       0.870     67.08897
GET       0.880     67.62976
GET       0.890     68.28026
GET       0.900     69.05889
GET       0.910     69.97936
GET       0.920     71.06799
GET       0.930     72.27930
GET       0.940     73.57468
GET       0.950     74.92820
GET       0.960     76.25456
GET       0.970     77.54831
GET       0.980     78.74728
GET       0.990     79.84750
GET       1.000     83.41752
GET       1.100     84.60076
GET       1.200     86.95534
GET       1.300     88.77055
GET       1.400     89.36308
GET       1.500     89.55209
GET       1.600     89.58752
GET       1.700     89.76812
GET       1.800     90.87835
GET       1.900     93.87310
GET       2.000     97.16065
GET       2.100     98.98364
GET       2.200     99.62239
GET       2.300     99.76931
GET       2.400     99.79309
GET       2.500     99.79510
GET       2.600     99.79600
GET       2.700     99.79864
GET       2.800     99.80272
GET       2.900     99.80420
GET       3.000     99.80484
GET       3.100     99.80495
GET       3.300     99.80510
GET       3.400     99.80648
GET       3.500     99.81029
GET       3.600     99.82173
GET       3.700     99.84227
GET       3.800     99.87722
GET       3.900     99.91989
GET       4.000     99.95521
GET       4.100     99.97909
GET       4.200     99.99232
GET       4.300     99.99751
GET       4.400     99.99878
GET       4.500     99.99952
GET       4.600     99.99974
GET       4.700     99.99989
GET       5.000     99.99995
GET       5.100    100.00000